clarenceliu/Mplib/Toshaba/TMPM36B/cmsis_lib/lib/src/tmpm36b_udmac.c
/**
 *******************************************************************************
 * @file    tmpm36b_udmac.c
 * @brief   This file provides API functions for uDMAC driver.
 * @version V2.0.2.3
 * @date    2014/05/20
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LISENCE AGREEMENT.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2014 All rights reserved
 *******************************************************************************
 */


/* Includes ------------------------------------------------------------------*/
#include "tmpm36b_udmac.h"

#if defined(__TMPM36B_uDMAC_H)
/** @addtogroup TX03_Periph_Driver
  * @{
  */

/** @defgroup uDMAC
  * @brief uDMAC driver modules
  * @{
  */

/** @defgroup uDMAC_Private_Defines
  * @{
  */


/** @} */
/* End of group uDMAC_Private_Defines */

/** @defgroup uDMAC_Private_FunctionPrototypes
  * @{
  */

/** @} */
/* End of group uDMAC_Private_FunctionPrototypes */

/** @defgroup uDMAC_Private_Functions
  * @{
  */

/** @} */
/* End of group uDMAC_Private_Functions */

/** @defgroup uDMAC_Exported_Functions
  * @{
  */

/**
  * @brief  Get the state of specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B 
  * @retval The state of DMAC operation.
  *   This parameter can be one of the following values:
  *   DISABLE :  The DMAC unit is disabled.
  *   ENABLE  :  The DMAC unit is enabled.
  */
FunctionalState DMAC_GetDMACState(TSB_DMA_TypeDef * DMACx)
{
    FunctionalState state = DISABLE;

    assert_param(IS_DMAC_UNIT(DMACx));

    /* read DMACx->STATUS.b0, 0 is disable, 1 is enable */
    if (DMACx->STATUS & (uint32_t) 0x01U) {
        state = ENABLE;
    } else {
        /* Do nothing */
    }

    return state;
}


/**
  * @brief  Enable the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @retval None
  */
void DMAC_Enable(TSB_DMA_TypeDef * DMACx)
{
    assert_param(IS_DMAC_UNIT(DMACx));

    /* set DMACx->CFG.b0 */
    DMACx->CFG = (uint32_t) 0x01U;
}


/**
  * @brief  Disable the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @retval None
  */
void DMAC_Disable(TSB_DMA_TypeDef * DMACx)
{
    assert_param(IS_DMAC_UNIT(DMACx));

    /* clr DMACx->CFG.b0 */
    DMACx->CFG = (uint32_t) 0x00U;
}



/** 
  * @brief  Set the base address of the primary data of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @param  Addr: The base address of the primary data, bit0 to bit9 must be 0.
  * @retval None
  */
void DMAC_SetPrimaryBaseAddr(TSB_DMA_TypeDef * DMACx, uint32_t Addr)
{
    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CTRL_BASE(Addr));

    DMACx->CTRLBASEPTR = Addr;
}


/**
  * @brief  Get the primary/alternative base address of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @param  PriAlt: Select base address type.
  *   This parameter can be one of the following values:
  *   DMAC_PRIMARY :  Get primary base address
  *   DMAC_ALTERNATE:  Get alternative base address
  * @retval The base address of primary/alternative data.
  */
uint32_t DMAC_GetBaseAddr(TSB_DMA_TypeDef * DMACx, DMAC_PrimaryAlt PriAlt)
{
    uint32_t tmp = 0U;

    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_PRIMARYALT(PriAlt));

    if (PriAlt == DMAC_PRIMARY) {
        tmp = DMACx->CTRLBASEPTR;
    } else {
        tmp = DMACx->ALTCTRLBASEPTR;
    }

    return tmp;
}

/**
  * @brief  Set software transfer request to the specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   DMAC_ADC_END,   DMAC_SSP0_RX,   DMAC_SSP0_TX,   DMAC_SSP1_RX,
  *   DMAC_SSP1_TX,   DMAC_SSP2_RX,   DMAC_SSP2_TX,   DMAC_FUART4_RX,
  *   DMAC_FUART4_TX, DMAC_FUART5_RX, DMAC_FUART5_TX, DMAC_SIO0_RX,
  *   DMAC_SIO0_TX,   DMAC_SIO1_RX,   DMAC_SIO1_TX,   DMAC_SIO2_RX,
  *   DMAC_SIO2_TX,   DMAC_SIO3_RX,   DMAC_SIO3_TX,   DMAC_SBI0_RXTX,
  *   DMAC_SBI1_RXTX, DMAC_SBI2_RXTX, DMAC_TMRB0_CMP_MATCH,
  *   DMAC_TMRB1_CMP_MATCH, DMAC_TMRB2_CMP_MATCH, DMAC_TMRB3_CMP_MATCH,
  *   DMAC_TMRB4_CMP_MATCH, DMAC_PIN, DMAC_SW_TRG
  * @retval None.
  */
void DMAC_SetSWReq(TSB_DMA_TypeDef * DMACx, DMAC_Channel Channel)
{
    uint32_t tmp = 0U;

    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CHANNEL_ALL(Channel));

    /* write '1' to right bit position to requests a transfer */
    tmp = DMACx->CHNLSWREQUEST;
    tmp |= (0x01UL << ((uint32_t) Channel));
    DMACx->CHNLSWREQUEST = tmp;

}


/**
  * @brief  Set transfer type to the specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   when Type == DMAC_BURST:
  *   DMAC_ADC_END,   DMAC_SSP0_RX,   DMAC_SSP0_TX,   DMAC_SSP1_RX,
  *   DMAC_SSP1_TX,   DMAC_SSP2_RX,   DMAC_SSP2_TX,   DMAC_FUART4_RX,
  *   DMAC_FUART4_TX, DMAC_FUART5_RX, DMAC_FUART5_TX, DMAC_SIO0_RX,
  *   DMAC_SIO0_TX,   DMAC_SIO1_RX,   DMAC_SIO1_TX,   DMAC_SIO2_RX,
  *   DMAC_SIO2_TX,   DMAC_SIO3_RX,   DMAC_SIO3_TX,   DMAC_SBI0_RXTX,
  *   DMAC_SBI1_RXTX, DMAC_SBI2_RXTX, DMAC_TMRB0_CMP_MATCH,
  *   DMAC_TMRB1_CMP_MATCH, DMAC_TMRB2_CMP_MATCH, DMAC_TMRB3_CMP_MATCH,
  *   DMAC_TMRB4_CMP_MATCH, DMAC_PIN, DMAC_SW_TRG
  *   when Type == DMAC_SINGLE:
  *   DMAC_SSP0_RX,   DMAC_SSP0_TX,   DMAC_SSP1_RX,   DMAC_SSP1_TX, 
  *   DMAC_SSP2_RX,   DMAC_SSP2_TX,   DMAC_FUART4_RX, DMAC_FUART4_TX,
  *   DMAC_FUART5_RX, DMAC_FUART5_TX 
  * @param  Type: Select transfer type
  *   This parameter can be one of the following values:
  *   DMAC_BURST  : Single transfer is disabled, only burst transfer request can be used.
  *   DMAC_SINGLE : Single transfer is enabled.
  * @retval None.
  */
void DMAC_SetTransferType(TSB_DMA_TypeDef * DMACx, DMAC_Channel Channel, DMAC_TransferType Type)
{
    uint32_t tmp = 0U;

    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_TRANSFERTYPE(Type));

    if (Type == DMAC_BURST) {
        assert_param(IS_DMAC_CHANNEL_BURST(Channel));
        /* Write '1' to _SET to disables the single transfer to the channel, and only burst transfer request is valid */
        tmp = DMACx->CHNLUSEBURSTSET;
        tmp |= 0x01UL << ((uint32_t) Channel);
        DMACx->CHNLUSEBURSTSET = tmp;
    } else {
        assert_param(IS_DMAC_CHANNEL_SINGLE(Channel));
        /* Write "1" to _CLR to enables the single transfer to the corresponding channel */
        /* this SFR is write only */
        tmp = DMACx->CHNLUSEBURSTCLR;
        tmp |= 0x01UL << ((uint32_t) Channel);
        DMACx->CHNLUSEBURSTCLR = tmp;
    }
}

/**
  * @brief  Get transfer type setting for the specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   DMAC_ADC_END,   DMAC_SSP0_RX,   DMAC_SSP0_TX,   DMAC_SSP1_RX,
  *   DMAC_SSP1_TX,   DMAC_SSP2_RX,   DMAC_SSP2_TX,   DMAC_FUART4_RX,
  *   DMAC_FUART4_TX, DMAC_FUART5_RX, DMAC_FUART5_TX, DMAC_SIO0_RX,
  *   DMAC_SIO0_TX,   DMAC_SIO1_RX,   DMAC_SIO1_TX,   DMAC_SIO2_RX,
  *   DMAC_SIO2_TX,   DMAC_SIO3_RX,   DMAC_SIO3_TX,   DMAC_SBI0_RXTX,
  *   DMAC_SBI1_RXTX, DMAC_SBI2_RXTX, DMAC_TMRB0_CMP_MATCH,
  *   DMAC_TMRB1_CMP_MATCH, DMAC_TMRB2_CMP_MATCH, DMAC_TMRB3_CMP_MATCH,
  *   DMAC_TMRB4_CMP_MATCH, DMAC_PIN, DMAC_SW_TRG
  * @retval The transfer type.
  *   DMAC_BURST  : Only burst transfer request can be used.
  *   DMAC_SINGLE : Single transfer is enabled.
  */
DMAC_TransferType DMAC_GetTransferType(TSB_DMA_TypeDef * DMACx, DMAC_Channel Channel)
{
    uint32_t tmp = 0U;
    DMAC_TransferType Type = DMAC_SINGLE;

    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CHANNEL_ALL(Channel));

