clarenceliu/Mplib/Toshaba/TMPM36B/cmsis_lib/lib/src/tmpm36b_udmac.c
    tmp = DMACx->CHNLUSEBURSTSET & (0x01UL << ((uint32_t) Channel));
    if (tmp) {
        /* read _SET, if bit is not 0, Only burst transfer request can be used */
        Type = DMAC_BURST;
    } else {
        Type = DMAC_SINGLE;
    }

    return Type;
}


/**
  * @brief  Set mask for the specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   DMAC_ADC_END,   DMAC_SSP0_RX,   DMAC_SSP0_TX,   DMAC_SSP1_RX,
  *   DMAC_SSP1_TX,   DMAC_SSP2_RX,   DMAC_SSP2_TX,   DMAC_FUART4_RX,
  *   DMAC_FUART4_TX, DMAC_FUART5_RX, DMAC_FUART5_TX, DMAC_SIO0_RX,
  *   DMAC_SIO0_TX,   DMAC_SIO1_RX,   DMAC_SIO1_TX,   DMAC_SIO2_RX,
  *   DMAC_SIO2_TX,   DMAC_SIO3_RX,   DMAC_SIO3_TX,   DMAC_SBI0_RXTX,
  *   DMAC_SBI1_RXTX, DMAC_SBI2_RXTX, DMAC_TMRB0_CMP_MATCH,
  *   DMAC_TMRB1_CMP_MATCH, DMAC_TMRB2_CMP_MATCH, DMAC_TMRB3_CMP_MATCH,
  *   DMAC_TMRB4_CMP_MATCH, DMAC_PIN, DMAC_SW_TRG
  * @param  NewState: Clear or set the mask to enable or disable the DMA channel
  *   This parameter can be one of the following values:
  *   ENABLE  : The DMA channel mask is cleared, DMA request is enable(valid)
  *   DISABLE :  The DMA channel is masked, DMA request is disable(invalid)
  * @retval None
  */
void DMAC_SetMask(TSB_DMA_TypeDef * DMACx, DMAC_Channel Channel, FunctionalState NewState)
{
    uint32_t tmp = 0U;

    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CHANNEL_ALL(Channel));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* ENABLE: clear mask to enable DMA channel,(valid). write '1' to _CLR */
        tmp = DMACx->CHNLREQMASKCLR;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMACx->CHNLREQMASKCLR = tmp;
    } else {
        /* DISABLE: set mask to disable DMA channel, (invalid), write '1' to _SET */
        tmp = DMACx->CHNLREQMASKSET;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMACx->CHNLREQMASKSET = tmp;
    }

}


/**
  * @brief  Get mask setting for the specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   DMAC_ADC_END,   DMAC_SSP0_RX,   DMAC_SSP0_TX,   DMAC_SSP1_RX,
  *   DMAC_SSP1_TX,   DMAC_SSP2_RX,   DMAC_SSP2_TX,   DMAC_FUART4_RX,
  *   DMAC_FUART4_TX, DMAC_FUART5_RX, DMAC_FUART5_TX, DMAC_SIO0_RX,
  *   DMAC_SIO0_TX,   DMAC_SIO1_RX,   DMAC_SIO1_TX,   DMAC_SIO2_RX,
  *   DMAC_SIO2_TX,   DMAC_SIO3_RX,   DMAC_SIO3_TX,   DMAC_SBI0_RXTX,
  *   DMAC_SBI1_RXTX, DMAC_SBI2_RXTX, DMAC_TMRB0_CMP_MATCH,
  *   DMAC_TMRB1_CMP_MATCH, DMAC_TMRB2_CMP_MATCH, DMAC_TMRB3_CMP_MATCH,
  *   DMAC_TMRB4_CMP_MATCH, DMAC_PIN, DMAC_SW_TRG
  * @retval The inverted mask setting.
  *   ENABLE  : The DMA channel mask is cleared, DMA request is enable(valid)
  *   DISABLE : The DMA channel is masked, DMA request is disable(invalid)
  */
FunctionalState DMAC_GetMask(TSB_DMA_TypeDef * DMACx, DMAC_Channel Channel)
{
    uint32_t tmp = 0U;
    FunctionalState state = DISABLE;

    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CHANNEL_ALL(Channel));

    /* read _SET, mask with '1 << Channel' */
    tmp = DMACx->CHNLREQMASKSET & (uint32_t) (0x01UL << ((uint32_t) Channel));
    if (tmp) {                  /* if result is not 0, return DISABLE */
        state = DISABLE;
    } else {                    /* if result is 0, return ENABLE */
        state = ENABLE;
    }

    return state;
}

/**
  * @brief  Enable or disable the specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   DMAC_ADC_END,   DMAC_SSP0_RX,   DMAC_SSP0_TX,   DMAC_SSP1_RX,
  *   DMAC_SSP1_TX,   DMAC_SSP2_RX,   DMAC_SSP2_TX,   DMAC_FUART4_RX,
  *   DMAC_FUART4_TX, DMAC_FUART5_RX, DMAC_FUART5_TX, DMAC_SIO0_RX,
  *   DMAC_SIO0_TX,   DMAC_SIO1_RX,   DMAC_SIO1_TX,   DMAC_SIO2_RX,
  *   DMAC_SIO2_TX,   DMAC_SIO3_RX,   DMAC_SIO3_TX,   DMAC_SBI0_RXTX,
  *   DMAC_SBI1_RXTX, DMAC_SBI2_RXTX, DMAC_TMRB0_CMP_MATCH,
  *   DMAC_TMRB1_CMP_MATCH, DMAC_TMRB2_CMP_MATCH, DMAC_TMRB3_CMP_MATCH,
  *   DMAC_TMRB4_CMP_MATCH, DMAC_PIN, DMAC_SW_TRG
  * @param  NewState: Enable or disable the DMA channel
  *   This parameter can be one of the following values:
  *   ENABLE  : The DMA channel will be enabled
  *   DISABLE : The DMA channel will be disabled
  * @retval None
  */
void DMAC_SetChannel(TSB_DMA_TypeDef * DMACx, DMAC_Channel Channel, FunctionalState NewState)
{
    uint32_t tmp = 0U;

    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CHANNEL_ALL(Channel));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* ENABLE: write '1' to _SET */
        tmp = DMACx->CHNLENABLESET;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMACx->CHNLENABLESET = tmp;
    } else {
        /* DISABLE: write '1' to _CLR */
        tmp = DMACx->CHNLENABLECLR;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMACx->CHNLENABLECLR = tmp;
    }
}


/**
  * @brief  Get the enable/disable setting for specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   DMAC_ADC_END,   DMAC_SSP0_RX,   DMAC_SSP0_TX,   DMAC_SSP1_RX,
  *   DMAC_SSP1_TX,   DMAC_SSP2_RX,   DMAC_SSP2_TX,   DMAC_FUART4_RX,
  *   DMAC_FUART4_TX, DMAC_FUART5_RX, DMAC_FUART5_TX, DMAC_SIO0_RX,
  *   DMAC_SIO0_TX,   DMAC_SIO1_RX,   DMAC_SIO1_TX,   DMAC_SIO2_RX,
  *   DMAC_SIO2_TX,   DMAC_SIO3_RX,   DMAC_SIO3_TX,   DMAC_SBI0_RXTX,
  *   DMAC_SBI1_RXTX, DMAC_SBI2_RXTX, DMAC_TMRB0_CMP_MATCH,
  *   DMAC_TMRB1_CMP_MATCH, DMAC_TMRB2_CMP_MATCH, DMAC_TMRB3_CMP_MATCH,
  *   DMAC_TMRB4_CMP_MATCH, DMAC_PIN, DMAC_SW_TRG
  * @retval  The enable/disable setting for channel
  *   ENABLE  : The DMA channel is enabled
  *   DISABLE : The DMA channel is disabled  
  */
FunctionalState DMAC_GetChannelState(TSB_DMA_TypeDef * DMACx, DMAC_Channel Channel)
{
    uint32_t tmp = 0U;
    FunctionalState state = DISABLE;

    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CHANNEL_ALL(Channel));

    /* read _SET, mask with '1 << Channel' */
    tmp = DMACx->CHNLENABLESET & (uint32_t) (0x01UL << ((uint32_t) Channel));
    if (tmp) {                  /* if result is not 0, return DISABLE */
        state = DISABLE;
    } else {                    /* if result is 0, return ENABLE */
        state = ENABLE;
    }

    return state;
}


/**
  * @brief  Set to use primary data or alternative data for specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   DMAC_ADC_END, DMAC_SSP0_RX, DMAC_SSP0_TX, DMAC_SSP1_RX,
  *   DMAC_SSP1_TX, DMAC_SSP2_RX, DMAC_SSP2_TX, DMAC_FUART4_RX,
  *   DMAC_FUART4_TX, DMAC_FUART5_RX, DMAC_FUART5_TX, DMAC_SIO0_RX,
  *   DMAC_SIO0_TX, DMAC_SIO1_RX, DMAC_SIO1_TX, DMAC_SIO2_RX,
  *   DMAC_SIO2_TX, DMAC_SIO3_RX, DMAC_SIO3_TX, DMAC_SBI0_RXTX,
  *   DMAC_SBI1_RXTX, DMAC_SBI2_RXTX, DMAC_TMRB0_CMP_MATCH,
  *   DMAC_TMRB1_CMP_MATCH, DMAC_TMRB2_CMP_MATCH, DMAC_TMRB3_CMP_MATCH,
  *   DMAC_TMRB4_CMP_MATCH, DMAC_PIN, DMAC_SW_TRG
  * @param  PriAlt: Select primary data or alternative data for channel specified by 'Channel' above
  *   This parameter can be one of the following values:
  *   DMAC_PRIMARY   : Channel will use primary data
  *   DMAC_ALTERNATE : Channel will use alternative data
  * @retval None
  */
void DMAC_SetPrimaryAlt(TSB_DMA_TypeDef * DMACx, DMAC_Channel Channel, DMAC_PrimaryAlt PriAlt)
{
    uint32_t tmp = 0U;

    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CHANNEL_ALL(Channel));
    assert_param(IS_DMAC_PRIMARYALT(PriAlt));

