clarenceliu/Mplib/Toshaba/TMPM36B/cmsis_lib/lib/src/tmpm36b_udmac.c
    if (PriAlt == DMAC_PRIMARY) {
        /* PRIMARY: write '1' to _CLR */
        tmp = DMACx->CHNLPRIALTCLR;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMACx->CHNLPRIALTCLR = tmp;
    } else {
        /* ALTERNATE: write '1' to _SET */
        tmp = DMACx->CHNLPRIALTSET;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMACx->CHNLPRIALTSET = tmp;
    }

}


/**
  * @brief  Get the setting of the using of primary data or alternative data for specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   DMAC_ADC_END, DMAC_SSP0_RX, DMAC_SSP0_TX, DMAC_SSP1_RX,
  *   DMAC_SSP1_TX, DMAC_SSP2_RX, DMAC_SSP2_TX, DMAC_FUART4_RX,
  *   DMAC_FUART4_TX, DMAC_FUART5_RX, DMAC_FUART5_TX, DMAC_SIO0_RX,
  *   DMAC_SIO0_TX, DMAC_SIO1_RX, DMAC_SIO1_TX, DMAC_SIO2_RX,
  *   DMAC_SIO2_TX, DMAC_SIO3_RX, DMAC_SIO3_TX, DMAC_SBI0_RXTX,
  *   DMAC_SBI1_RXTX, DMAC_SBI2_RXTX, DMAC_TMRB0_CMP_MATCH,
  *   DMAC_TMRB1_CMP_MATCH, DMAC_TMRB2_CMP_MATCH, DMAC_TMRB3_CMP_MATCH,
  *   DMAC_TMRB4_CMP_MATCH, DMAC_PIN, DMAC_SW_TRG
  * @retval The setting of the using of primary data or alternative data
  *   DMAC_PRIMARY   : Channel is using primary data 
  *   DMAC_ALTERNATE : Channel is using alternative data
  */
DMAC_PrimaryAlt DMAC_GetPrimaryAlt(TSB_DMA_TypeDef * DMACx, DMAC_Channel Channel)
{
    uint32_t tmp = 0U;
    DMAC_PrimaryAlt PriAlt = DMAC_PRIMARY;

    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CHANNEL_ALL(Channel));

    /* read _SET, mask with '1 << Channel' */
    tmp = DMACx->CHNLPRIALTSET & (uint32_t) (0x01UL << (uint32_t) Channel);
    if (tmp) {                  /* if result is not 0, return _ALTERNATE */
        PriAlt = DMAC_ALTERNATE;
    } else {                    /* if result is 0, return _PRIMARY */
        PriAlt = DMAC_PRIMARY;
    }

    return PriAlt;
}


/**
  * @brief  Set the priority for specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   DMAC_ADC_END, DMAC_SSP0_RX, DMAC_SSP0_TX, DMAC_SSP1_RX,
  *   DMAC_SSP1_TX, DMAC_SSP2_RX, DMAC_SSP2_TX, DMAC_FUART4_RX,
  *   DMAC_FUART4_TX, DMAC_FUART5_RX, DMAC_FUART5_TX, DMAC_SIO0_RX,
  *   DMAC_SIO0_TX, DMAC_SIO1_RX, DMAC_SIO1_TX, DMAC_SIO2_RX,
  *   DMAC_SIO2_TX, DMAC_SIO3_RX, DMAC_SIO3_TX, DMAC_SBI0_RXTX,
  *   DMAC_SBI1_RXTX, DMAC_SBI2_RXTX, DMAC_TMRB0_CMP_MATCH,
  *   DMAC_TMRB1_CMP_MATCH, DMAC_TMRB2_CMP_MATCH, DMAC_TMRB3_CMP_MATCH,
  *   DMAC_TMRB4_CMP_MATCH, DMAC_PIN, DMAC_SW_TRG
  * @param  Priority: Select Priority.
  *   This parameter can be one of the following values:
  *   DMAC_PRIOTIRY_NORMAL : Normal priority
  *   DMAC_PRIOTIRY_HIGH   : High priority
  * @retval None
  */
void DMAC_SetChannelPriority(TSB_DMA_TypeDef * DMACx, DMAC_Channel Channel, DMAC_Priority Priority)
{
    uint32_t tmp = 0U;

    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CHANNEL_ALL(Channel));
    assert_param(IS_DMAC_PRIORITY(Priority));

    if (Priority == DMAC_PRIOTIRY_NORMAL) {
        /* DMAC_PRIOTIRY_NORMAL: write '1' to _CLR */
        tmp = DMACx->CHNLPRIORITYCLR;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMACx->CHNLPRIORITYCLR = tmp;
    } else {
        /* DMAC_PRIOTIRY_HIGH: write '1' to _SET */
        tmp = DMACx->CHNLPRIORITYSET;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMACx->CHNLPRIORITYSET = tmp;
    }

}


/**
  * @brief  Get the priority setting for specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   DMAC_ADC_END, DMAC_SSP0_RX, DMAC_SSP0_TX, DMAC_SSP1_RX,
  *   DMAC_SSP1_TX, DMAC_SSP2_RX, DMAC_SSP2_TX, DMAC_FUART4_RX,
  *   DMAC_FUART4_TX, DMAC_FUART5_RX, DMAC_FUART5_TX, DMAC_SIO0_RX,
  *   DMAC_SIO0_TX, DMAC_SIO1_RX, DMAC_SIO1_TX, DMAC_SIO2_RX,
  *   DMAC_SIO2_TX, DMAC_SIO3_RX, DMAC_SIO3_TX, DMAC_SBI0_RXTX,
  *   DMAC_SBI1_RXTX, DMAC_SBI2_RXTX, DMAC_TMRB0_CMP_MATCH,
  *   DMAC_TMRB1_CMP_MATCH, DMAC_TMRB2_CMP_MATCH, DMAC_TMRB3_CMP_MATCH,
  *   DMAC_TMRB4_CMP_MATCH, DMAC_PIN, DMAC_SW_TRG
  *   DMAC_PIN,
  *   DMAC_SW_TRG
  * @retval  The priority setting of channel
  *   DMAC_PRIOTIRY_NORMAL : Normal priority
  *   DMAC_PRIOTIRY_HIGH   : High priority
  */
DMAC_Priority DMAC_GetChannelPriority(TSB_DMA_TypeDef * DMACx, DMAC_Channel Channel)
{
    uint32_t tmp = 0U;
    DMAC_Priority Priority = DMAC_PRIOTIRY_NORMAL;

    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CHANNEL_ALL(Channel));

    /* read _SET, mask with '1 << Channel' */
    tmp = DMACx->CHNLPRIORITYSET & (uint32_t) (0x01UL << (uint32_t) Channel);
    if (tmp) {                  /* if result is not 0, return _PRIOTIRY_HIGH */
        Priority = DMAC_PRIOTIRY_HIGH;
    } else {                    /* if result is 0, return _PRIOTIRY_NORMAL */
        Priority = DMAC_PRIOTIRY_NORMAL;
    }

    return Priority;
}


/**
  * @brief  Clear the bus error of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @retval None
  */
void DMAC_ClearBusErr(TSB_DMA_TypeDef * DMACx)
{
    assert_param(IS_DMAC_UNIT(DMACx));

    /* write '1' to bit0 */
    DMACx->ERRCLR = (uint32_t) 0x01U;
}

/**
  * @brief  Get the bus error state of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @retval The bus error state
  *   SUCCESS :  No bus error
  *            ERROR   :  There is error in bus
  */
Result DMAC_GetBusErrState(TSB_DMA_TypeDef * DMACx)
{
    Result tmp = SUCCESS;

    assert_param(IS_DMAC_UNIT(DMACx));
    /* read bit0, '0' is no error, '1' is error */
    if (DMACx->ERRCLR & (uint32_t) 0x01U) {
        tmp = ERROR;
    } else {
        /* Do nothing */
    }
    return tmp;
}



/**
  * @brief  Fill the DMA setting data of specified channel of the specified DMAC unit to RAM.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   DMAC_ADC_END, DMAC_SSP0_RX, DMAC_SSP0_TX, DMAC_SSP1_RX,
  *   DMAC_SSP1_TX, DMAC_SSP2_RX, DMAC_SSP2_TX, DMAC_FUART4_RX,
  *   DMAC_FUART4_TX, DMAC_FUART5_RX, DMAC_FUART5_TX, DMAC_SIO0_RX,
  *   DMAC_SIO0_TX, DMAC_SIO1_RX, DMAC_SIO1_TX, DMAC_SIO2_RX,
  *   DMAC_SIO2_TX, DMAC_SIO3_RX, DMAC_SIO3_TX, DMAC_SBI0_RXTX,
  *   DMAC_SBI1_RXTX, DMAC_SBI2_RXTX, DMAC_TMRB0_CMP_MATCH,
  *   DMAC_TMRB1_CMP_MATCH, DMAC_TMRB2_CMP_MATCH, DMAC_TMRB3_CMP_MATCH,
  *   DMAC_TMRB4_CMP_MATCH, DMAC_PIN, DMAC_SW_TRG
  * @param  InitStruct: the structure contain the DMA setting values.
  * @retval None
  */
void DMAC_FillInitData(TSB_DMA_TypeDef * DMACx, DMAC_Channel Channel, DMAC_InitTypeDef * InitStruct)
{
    DMAC_PrimaryAlt PriAlt = DMAC_PRIMARY;
    uint32_t Addr = 0U;
    uint32_t tmpCtrl = 0U;

    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CHANNEL_ALL(Channel));

